[LANGUAGE]
language=1


[CHINESE]
GUANYU_JIESHAO=游戏键盘驱动 V1.0
GUANYU_BANQUAN=版权所有 (C)    2017

SINGLE_STATIC=请输入一个单键
MACRO_NAME_SETTING=宏名称设定
KEY_SETTING_TISHI=按键设定
MACRO_EDIT_TISHI=宏编辑
MEDIA_EDIT_TISHI=多媒体按键
FUNCTION_TISHI=功能键设置

PROFILE_1 =情景模式1
PROFILE_2 = 情景模式2
PROFILE_3 = 情景模式3
PROFILE_MACRO = 宏编辑
PROFILE_DEFAULT=恢复默认设置
PROFILE_OK=确定
PROFILE_CANCLE = 取消
PROFILE_APPLY = 应用

MACRO_CYCLES=循环次数
RECORD_DELAY=记录按键延时
SINGLE_KEY=单键
MACRO_SETTING=宏设置
MULTI_MEDIA=多媒体
FUNCTION_KEY=功能键
A_TOP=上移到顶
A_UP=上移
A_DOWN=下移
A_BOTTOM=下移到底
A_RECORD=录制
A_DELETE=删除
A_CLEAR=清空	
MACRO_OK=确定
MACRO_CANCLE=取消


UNKNOWN_KEY=未知按键:%03x
MEDIA_PALYER_1=媒体播放器
MEDIA_PALY_PAUSE_2=播放/暂停
MEDIA_STOP_PALY_3=停止播放
MEDIA_PREV_TRACK_4=上一曲
MEDIA_Next_TRACK_5=下一曲
MEDIA_V_LOW_6=音量减
MEDIA_V_ADD_7=音量加
MEDIA_MUTE_8=静音
MEDIA_WWW_HOME_9=主页
MEDIA_WWW_REFRESH_10=刷新
MEDIA_WWW_STOP_11=停止
MEDIA_WWW_BACK_12=后退
MEDIA_WWW_FORWARD_13=前进
MEDIA_WWW_FAVORITE_14=收藏夹
MEDIA_WWW_SEARCH_15=搜索
MEDIA_MY_PC_16=我的电脑
MEDIA_CALC_17=计算器
MEDIA_MAIL_18=邮件


COMPOSITE_PROMPT_CLEAR =恢复按键默认功能
COMPOSITE_PROMPT_OSK =打开屏幕键盘
COMPOSITE_PROMPT_DEMO =当前使用的是DEMO程序版本，最大只能够建立2个宏!
COMPOSITE_MACRO_OVER =宏空间已经超出了硬件存放的大小

FUNC_KEY_DESC1=打开
FUNC_KEY_DESC2=新建
FUNC_KEY_DESC3=撤销
FUNC_KEY_DESC4=保存
FUNC_KEY_DESC5=复制
FUNC_KEY_DESC6=剪切
FUNC_KEY_DESC7=粘贴
FUNC_KEY_DESC8=查找
FUNC_KEY_DESC9=全选
FUNC_KEY_DESC10=缩小
FUNC_KEY_DESC11=放大
APPLY_PROMPT=你不能在<默认情景模式>下编辑!
MACRO_DELETE_CONFIRM_OF_KEYS=检测到某些按键设定指向这个宏,  \n  确实需要删除此宏?
KEY_PROMPT=正在编辑宏按键，不可以切换宏指示灯
KEY_PROMPT_SET=按键，设定为:
KEY_PROMPT_SINGLE=单键(
KEY_PROMPT_MACRO=宏(
KEY_PROMPT_MEDIA=多媒体(
KEY_PROMPT_FUNCTION=功能键(


MACRO_ACTION_RECORD_DELAY=记录按键延时
MACRO_NEW_PREFIX =宏
MACRO_ERR_MAX =最大宏个数为: %d
MACRO_ERR_SAME =相同的宏名
MACRO_ERR_NAME_SYSTEM =此宏被使用在系统中!
MACRO_DEFAULT_NAME =空宏
MACRO_ERR_RECORD =请先停止宏录制!
MACRO_PROMPT_DEMO =当前使用的是DEMO程序版本，最大只能够播放20次宏!
MACRO_KEYS_TISHI=按键
MACRO_ACTION_TISHI=动作
MACRO_DELAY_MS=延时(毫秒)

MACRO_ACTION_CLEAR_CONFIRM =确实需要清空宏动作?
MACRO_ACTION_ERR_MODIFY =无法编辑，请使用宏录制按键.
MACRO_ACTION_ERR_DELAY_MIN = 最小延迟时间为: %d(毫秒)
MACRO_ACTION_ERR_DELAY_MAX = 最大延迟时间为: %d(毫秒)
;MACRO_ACTION_RECORD =录制
;MACRO_ACTION_STOP_RECORD = 停止录制
MACRO_ACTION_ERR_KEYS_PROMPT =检测到当播放这个宏时，存在下列未被弹出的按键:
MACRO_ACTION_ERR_KEYS_PROMPT2 = \r\n  是否需要继续?
EXTRA_MACRO_TOO_LONG = 宏空间大小超出了硬件空间大小。\r\n 请减少宏个数或宏的动作个数，然后再下载.

DEFAULT_PROFILE_NAME =<默认情景模式>
PROFILE_SELECT_PROMPT =是否保存这个情景模式所做的设定?
PROFILE_SEELCT_PROMPT2 =当快速切换情景模式时，您首先必须关闭编辑对话框.
PROFILE_SELECT_PROMPT3 = 情景模式正在编辑，是否放弃所做修改并切换情景模式? 
PROFILE_LOAD_PROMPT = 切换情景模式会自动停止宏播放!
PROFILE_CHECK_PROMPT = 情景模式文件不存在，加载默认设置!
PROFILE_FORMAT_ERROR = 文件格式错误，恢复为默认值: \n  %s
PROFILE_NEW = \\新情景模式
PROFILE_TIP = 当前情景模式: 
PROFILE_EDITING = 正在编辑，设置未应用，不能切换情景模式
EXTRA_PROFILE_SPACE_TIGHT = 硬件空间紧张，取消了宏名的存储。

MAIN_UPDATE_ERROR_TEXT=请选择正确的更新文件!
MAIN_BOOT_ERROR_TEXT=无法进入Boot模式!
MAIN_SHELL_ERROR_TEXT=无法执行更新文件!
MAIN_UPDATE_BACKUP_OK=备份成功!
MAIN_UPDATE_BACKUP_NG=备份失败,请重新备份!

KEYBOARD_TRAY_DESC = 键盘驱动
MAIN_CAPTION = 游戏键盘设定
MAIN_HELP_PROMPT = 帮助
MAIN_MINIMIZE_PROMPT = 最小化
MAIN_MENU_PROMPT = 菜单
MAIN_CLOSE_PROMPT = 关闭
MAIN_BUTTON_DEARMO_VER =   // DRIVER VERSION V2.0
MAIN_PROMPT_DEFAULT = 是否要恢复默认设置？
MAIN_PROMPT_INPORT = 文件格式错误，导入失败! 
MAIN_PROMPT_DRIVER_TEXT = 检测到有未安装驱动的键盘，按[确定]进行驱动安装！
MAIN_PROMPT_DRIVER_TITLE = 键盘驱动
MAIN_SWITCH_FUNCTION_TEXT = 切换到按键颜色模式
MAIN_SWITCH_COLOR_TEXT = 切换到按键功能模式
MAIN_DEFAULT_MATRIX_PROMPT = 读取默认键盘布局失败
MAIN_NO_DEVICE_PROMPT = 未检测到设备，无法显示按键设置! 

MENU_1=还原
MENU_2=备份
MENU_3=关于
MENU_4=关闭
CHINESE_5=中文
ENGINSH_6=英文

MENU_11=打开(&O)
MENU_22=关于(&A)
MENU_33=退出(&X)




[ENGINSH]
GUANYU_JIESHAO=Redragon Mitra RGB-K551 English
GUANYU_BANQUAN=Modified By: Tauhidur Rashid


SINGLE_STATIC=Please input a single key
MACRO_NAME_SETTING=Macro Name
KEY_SETTING_TISHI=Key Setting
MACRO_EDIT_TISHI=Macro Configuration
MEDIA_EDIT_TISHI=Multi-Media Keys
FUNCTION_TISHI=Function Key Setting

; PROFILE_1=Profile 1
; PROFILE_2=Profile 2
; PROFILE_3=Profile 3
; PROFILE_MACRO=macro recording 
; PROFILE_DEFAULT=need to restore the default Settings?
; PROFILE_OK=confirm
; PROFILE_CANCLE=Cancel
; PROFILE_APPLY=Apply

MACRO_CYCLES=Loops (Max. 255)
RECORD_DELAY=Record Key Delay

SINGLE_KEY=Single key
MACRO_SETTING=Macro 
MULTI_MEDIA=Multimedia
FUNCTION_KEY=Function key
A_TOP=Top
A_UP=Up
A_DOWN=Down
A_BOTTOM=Bottom
A_RECORD=Record
A_DELETE=Delete
A_CLEAR=Empty
MACRO_OK=OK
MACRO_CANCLE=Cancel

UNKNOWN_KEY=Unknown Key: %03x
MEDIA_PALYER_1=Media Player
MEDIA_PALY_PAUSE_2=Play/Pause
MEDIA_STOP_PALY_3=Stop
MEDIA_PREV_TRACK_4=Previous 
MEDIA_Next_TRACK_5=Next Track
MEDIA_V_LOW_6=V -
MEDIA_V_ADD_7=V +
MEDIA_MUTE_8=Mute
MEDIA_WWW_HOME_9=Homepage
MEDIA_WWW_REFRESH_10=Refresh
MEDIA_WWW_STOP_11=Web Stop
MEDIA_WWW_BACK_12=Back up
MEDIA_WWW_FORWARD_13=Forward
MEDIA_WWW_FAVORITE_14=Favorites
MEDIA_WWW_SEARCH_15=Search
MEDIA_MY_PC_16=My Computer
MEDIA_CALC_17=Calculator
MEDIA_MAIL_18=Email

COMPOSITE_PROMPT_CLEAR =Restore the default function of buttons
COMPOSITE_PROMPT_OSK =Open the on-screen keyboard
COMPOSITE_PROMPT_DEMO =Currently used is the DEMO program version, can only play 20 largest macro!
COMPOSITE_MACRO_OVER =The size of the macro space beyond the hardware store

FUNC_KEY_DESC1=Open
FUNC_KEY_DESC2=New
FUNC_KEY_DESC3=Undo
FUNC_KEY_DESC4=Save
FUNC_KEY_DESC5=Copy
FUNC_KEY_DESC6=Cut
FUNC_KEY_DESC7=Paste
FUNC_KEY_DESC8=Find
FUNC_KEY_DESC9=Select All
FUNC_KEY_DESC10=narrowing
FUNC_KEY_DESC11=widening
APPLY_PROMPT=You can't edit under default scene mode 
MACRO_DELETE_CONFIRM_OF_KEYS=Macro is assigned to a key, do you really want to delete it?
KEY_PROMPT=You are editing a macro buttons, can not switch the macro light
KEY_PROMPT_SET=Set the key as:
KEY_PROMPT_SINGLE=one-button(
KEY_PROMPT_MACRO=Macro(
KEY_PROMPT_MEDIA=multimedia(
KEY_PROMPT_FUNCTION=Function(

MACRO_ACTION_RECORD_DELAY=Record delay between keystrokes
MACRO_NEW_PREFIX =Macro
MACRO_ERR_MAX =Up to 100 Macros Possible.
MACRO_ERR_SAME =Same macro name!
MACRO_ERR_NAME_SYSTEM =This macro is used in the system!
MACRO_DEFAULT_NAME =Empty Macro
MACRO_ERR_RECORD =Please stop the macro record first!
MACRO_PROMPT_DEMO =Currently using a DEMO version of the program, can only play 20 times the maximum macro!
MACRO_KEYS_TISHI=Key
MACRO_ACTION_TISHI=Action
MACRO_DELAY_MS=Delay(ms)
MACRO_ACTION_CLEAR_CONFIRM =Do you really want to delete the macro?
MACRO_ACTION_ERR_MODIFY =Do you really want to delete the macro action?
MACRO_ACTION_ERR_DELAY_MIN = Minimum delay time is: %d(ms)
MACRO_ACTION_ERR_DELAY_MAX = Maximum delay time is: %d(ms)
MACRO_ACTION_RECORD =Start Record
MACRO_ACTION_STOP_RECORD = Stop Record
MACRO_ACTION_ERR_KEYS_PROMPT =When playing this macro is detected，the presence of the following was not eject buttons:
MACRO_ACTION_ERR_KEYS_PROMPT2 =Whether you need to continue or not?
EXTRA_MACRO_TOO_LONG = Macro space size is beyond the hardware space size

DEFAULT_PROFILE_NAME =<Default Profile>
PROFILE_SELECT_PROMPT =Save this scene mode setting?
PROFILE_SEELCT_PROMPT2 =When fast switch scene mode, you must first close the editor dialog box.
PROFILE_SELECT_PROMPT3 = Scene mode are editing, whether to give up the modification and change its mode?
PROFILE_LOAD_PROMPT = Switch scene mode will automatically stop the macro play!
PROFILE_CHECK_PROMPT = Scene mode file does not exist, load the default Settings!
PROFILE_FORMAT_ERROR = wrong file format, revert to the default values: \n  %s
PROFILE_NEW = \\The new contextual  mode
PROFILE_TIP = The current contextual  mode:
PROFILE_EDITING = You are editing, set not applications, can't change its mode
EXTRA_PROFILE_SPACE_TIGHT = shortage of hardware space, cancelled the macro name of storage.

MAIN_UPDATE_ERROR_TEXT=Please select the correct update file!
MAIN_BOOT_ERROR_TEXT=Unable to enter the Boot mode!
MAIN_SHELL_ERROR_TEXT=Unable to perform updating file!
MAIN_UPDATE_BACKUP_OK=Backup successfully created
MAIN_UPDATE_BACKUP_NG=Backup failed, please backup again!

KEYBOARD_TRAY_DESC = Mechanical Keyboard
MAIN_CAPTION =Mechanical Keyboard
MAIN_HELP_PROMPT = Help
MAIN_MINIMIZE_PROMPT = Minimize
MAIN_MENU_PROMPT = Menu
MAIN_CLOSE_PROMPT = Close
MAIN_BUTTON_DEARMO_VER =
MAIN_PROMPT_DEFAULT =Are you sure you want to reset the current settings?
MAIN_PROMPT_INPORT = File format error, import failed! 
MAIN_PROMPT_DRIVER_TEXT = Detects that the driver is not installed keyboard, \r\npress [OK] to start the driver installation!
MAIN_PROMPT_DRIVER_TITLE = Mechanical Keyboard

MACRO_ACTION_DELETE_CONFIRM=Do you really want to delete the macro action?
MAIN_SWITCH_FUNCTION_TEXT = Switch to the color keys mode
MAIN_SWITCH_COLOR_TEXT = Switch to the function keys mode
MAIN_DEFAULT_MATRIX_PROMPT = Reads the default keyboard layout failure
MAIN_NO_DEVICE_PROMPT = Device is not detected，the key settings can not be displayed!

MENU_1=Import
MENU_2=Export
MENU_3=About
MENU_4=Close
CHINESE_5=Chinese
ENGINSH_6=English

MENU_11=Open
MENU_22=About
MENU_33=Exit
